package Lection4;
/* Лабораторная работа 4_Массивы_Циклы
 Задание: используя цикл for необходимо вывести на экран таблицу умножения на 7. */
//
public class Laba4 {
    public static void main(String[] args) {

        for(int i=1; i<=10; i++){
            System.out.println(i + "*"+ 7 + "=" + i*7);
        }
    }
}
